Repository: sebaualde/RingBearer
Catalog: RingBearer.Core/Resources/Messages.*.resx
Languages: es, it, pt

# AddOrUpdHelpText1
source: Creates or updates an entry with the provided values.
es: Crea o actualiza una entrada con los valores proporcionados.
it: Crea o aggiorna una voce con i valori forniti.
pt: Cria ou atualiza uma entrada com os valores fornecidos.

# AddOrUpdHelpText2
source: To remove a value, include its prefix without any data.
es: Para eliminar un valor, incluí su prefijo sin datos.
it: Per rimuovere un valore, includi il suo prefisso senza dati.
pt: Para remover um valor, inclua seu prefixo sem nenhum dado.

# AddOrUpdHelpText3
source: Ex: add entryKey -p -n -u clear all fileds.
es: Ej: add entryKey -p -n -u elimina todos los campos.
it: Es: aggiungi chiaveVoce -p -n -u cancella tutti i campi.
pt: Ex: adicionar chaveEntrada -p -n -u limpar todos os campos.

# AssemblyNameNullError
source: The assembly name cannot be null or empty.
es: El nombre del ensamblado no puede ser nulo o vacío.
it: Il nome dell’assembly non può essere nullo o vuoto.
pt: O nome do assembly não pode ser nulo ou vazio.

# CommandNullError
source: Command cannot be empty. Please enter a valid command.
es: El comando no puede estar vacío. Por favor, ingresá un comando válido.
it: Il comando non può essere vuoto. Inserisci un comando valido.
pt: O comando não pode estar vazio. Por favor, insira um comando válido.

# EntriesListTitle
source: │ Entries List │
es: │ Lista de entradas │
it: │ Elenco delle Voci │
pt: │ Lista de Entradas │

# EntryAdded
source: New entry added successfully.
es: Nueva entrada agregada exitosamente.
it: Nuova voce aggiunta con successo.
pt: Nova entrada adicionada com sucesso.

# EntryAlreadyExists
source: An entry with the key: "{0}" already exists.
es: Ya existe una entrada con la clave: "{0}".
it: Esiste già un'entrata con la chiave: "{0}".
pt: Uma entrada com a chave : "{0}" já existe.

# EntryDeleted
source: Entry deleted successfully.
es: Entrada eliminada exitosamente.
it: Voce eliminata con successo.
pt: Entrada excluída com sucesso.

# EntryNotFound
source: Entry with the specified key not found.
es: No se encontró una entrada con la clave especificada.
it: Voce con la chiave specificata non trovata.
pt: Não foi encontrada uma entrada com a chave especificada.

# EntryNullError
source: Entry cannot be null.
es: La entrada no puede ser nula.
it: La voce non può essere nulla.
pt: A entrada não pode ser nula.

# EntryUpdated
source: Entry updated successfully.
es: Entrada actualizada exitosamente.
it: Voce aggiornata con successo.
pt: Entrada atualizada com sucesso.

# ExitApp
source: Exiting manager, press a key to finish...
es: Saliendo del gestor, presioná una tecla para finalizar...
it: Chiusura del gestore, premi un tasto per terminare...
pt: Encerrando o gerenciador, pressione uma tecla para finalizar...

# ExitEscApp
source: Press [ Esc ] to exit.
es: Presioná [ Esc ] para salir.
it: Premi [ Esc ] per uscire.
pt: Pressione [ Esc ] para sair.

# FilePahtNullError
source: File path cannot be null or empty.
es: La ruta del archivo no puede ser nula o vacía.
it: Il percorso del file non può essere nullo o vuoto.
pt: O caminho do arquivo não pode ser nulo ou vazio.

# HeaderKeyTable
source: Key
es: Clave
it: Chiave
pt: Chave

# HeaderNotesTable
source: Notes
es: Notas
it: Note
pt: Notas

# HeaderPassTable
source: Password
es: Contraseña
pt: Senha

# HeaderSubtitle
source: ║ Keep it secret, keep it safe. ║
es: ║ Mantenlo en secreto, mantenlo a salvo. ║
it: ║ Tienilo segreto, tienilo al sicuro. ║
pt: ║ Mantenha em segredo, mantenha seguro. ║

# HeaderUserTable
source: User
es: Usuario
it: Utente
pt: Usuário

# HelpAddExplanation
source: Adds a new entry to the file.
es: Agrega una nueva entrada al archivo.
it: Aggiunge una nuova voce al file.
pt: Adiciona uma nova entrada ao arquivo.

# HelpLangExplanation
source: Available languages:
es: Idiomas disponibles:
it: Lingue disponibili:
pt: Idiomas disponíveis:

# HelpCmkExplanation
source: Changes the master password.
es: Cambia la contraseña maestra.
it: Cambia la password principale.
pt: Altera a senha mestra.

# HelpDelExplanation
source: Deletes an entry from the file.
es: Elimina una entrada del archivo.
it: Elimina una voce dal file.
pt: Exclui uma entrada do arquivo.

# HelpExitExplanation
source: Closes the manager.
es: Cierra el gestor.
it: Chiude il gestore.
pt: Fecha o gerenciador.

# HelpFilterExplanation1
source: Searches for entries that match the word
es: Busca entradas que coincidan con la palabra
it: Cerca le voci che corrispondono alla parola
pt: Procura por entradas que correspondam à palavra

# HelpFilterExplanation2
source: in either the key or the value.
es: en la clave o en el valor.
it: nella chiave o nel valore.
pt: na chave ou no valor.

# HelpGetExplanation
source: Looks up an entry in the file.
es: Busca una entrada en el archivo.
it: Cerca una voce nel file.
pt: Procura uma entrada no arquivo.

# HelpHelpExplanation
source: Displays help for a specific command.
es: Muestra la ayuda para un comando específico.
it: Mostra l’aiuto per un comando specifico.
pt: Exibe ajuda para um comando específico.

# HelpLsExplanation
source: Shows all entries in the file.
es: Muestra todas las entradas del archivo.
it: Mostra tutte le voci nel file.
pt: Mostra todas as entradas no arquivo.

# HelpSubtitle
source: AVAILABLE COMMANDS
es: COMANDOS DISPONIBLES
it: COMANDI DISPONIBILI
pt: COMANDOS DISPONÍVEIS

# HelpTitle
source: Enter [ h ] to see the list of commands.
es: Ingresá [ h ] para ver la lista de comandos.
it: Digita [ h ] per vedere l’elenco dei comandi.
pt: Digite [ h ] para ver a lista de comandos.

# HelpUpdateExplanation
source: Updates an existing entry in the file.
es: Actualiza una entrada existente en el archivo.
it: Aggiorna una voce esistente nel file.
pt: Atualiza uma entrada existente no arquivo.

# InvalidEntry
source: Invalid entry. Please check the entered data.
es: Entrada inválida. Por favor, revisá los datos ingresados.
it: Voce non valida. Controlla i dati inseriti.
pt: Entrada inválida. Por favor, verifique os dados inseridos.

# InvalidMasterKeyError
source: Invalid master key. Please check your password and try again.
es: Contraseña maestra inválida. Revisá tu clave e intentá de nuevo.
it: Chiave principale non valida. Controlla la password e riprova.
pt: Chave mestra inválida. Por favor, verifique sua senha e tente novamente.

# KeyNullError
source: Key cannot be null or empty.
es: La clave no puede ser nula o vacía.
it: La chiave non può essere nulla o vuota.
pt: A chave não pode ser nula ou vazia.

# KeywordNullError
source: Keyword cannot be null or empty.
es: La palabra clave no puede ser nula o vacía.
it: La parola chiave non può essere nulla o vuota.
pt: Palavra-chave não pode ser nula ou vazia.

# LoadFileError
source: Failed to load entries from the file.
es: No se pudieron cargar las entradas del archivo.
it: Errore nel caricamento delle voci dal file.
pt: Falha ao carregar entradas do arquivo.

# MasterKeyChanged
source: Master key changed successfully. Please remember it.
es: Contraseña maestra cambiada exitosamente. Asegurate de recordarla.
it: Chiave principale cambiata con successo. Ricordala.
pt: Chave mestra alterada com sucesso. Por favor, lembre-se dela.

# MasterKeyNullError
source: Master key cannot be null or empty.
es: La contraseña maestra no puede ser nula o vacía.
it: La chiave principale non può essere nulla o vuota.
pt: A chave mestra não pode ser nula ou vazia.

# MasterKeyText
source: Enter your password:
es: Ingresá tu contraseña:
it: Inserisci la tua password:
pt: Digite sua senha:

# NoEntries
source: No entries found.
es: No se encontraron entradas.
it: Nessuna voce trovata.
pt: Nenhuma entrada encontrada.

# NoKeyOnGetError
source: You must add the key of the entry (eg: get myEntry)
es: Debés ingresar la clave de la entrada (ej: get miEntrada)
it: Devi inserire la chiave della voce (es: get miaVoce)
pt: Você deve adicionar a chave da entrada (ex: obter minhaEntrada)

# PasswordNullError
source: Password cannot be null or empty.
es: La contraseña no puede ser nula o vacía.
it: La password non può essere nulla o vuota.
pt: A senha não pode ser nula ou vazia.

# PlainTextNullError
source: Plain text cannot be null or empty.
es: El texto plano no puede ser nulo o vacío.
it: Il testo in chiaro non può essere nullo o vuoto.
pt: Texto simples não pode ser nulo ou vazio.

# PressKeyToContinue
source: Press any key to continue...
es: Presioná cualquier tecla para continuar...
it: Premi un tasto per continuare...
pt: Pressione qualquer tecla para continuar...

# SaveFileError
source: Failed to save entries to the file.
es: No se pudieron guardar las entradas en el archivo.
it: Errore nel salvataggio delle voci nel file.
pt: Falha ao salvar entradas no arquivo.

# UnrecognizedCommand
source: Unrecognized command. Try again.
es: Comando no reconocido. Intentá de nuevo.
it: Comando non riconosciuto. Riprova.
pt: Comando não reconhecido. Tente novamente.

# UsernameNullError
source: Username cannot be null or empty.
es: El nombre de usuario no puede ser nulo o vacío.
it: Il nome utente non può essere nullo o vuoto.
pt: O nome de usuário não pode ser nulo ou vazio.

# NoLanguageOnGetError
source: Please provide a language code (e.g., 'en', 'es').
es: Por favor, proporciona un código de idioma (ej: 'en', 'es').
it: Fornisci un codice lingua (es. 'en', 'es').
pt: Por favor, forneça um código de idioma (por exemplo, 'en', 'es').

# LanguageChanged
source: Language changed successfully. Restart the app to see the changes.
es: Idioma cambiado correctamente. Reiniciá la aplicación para ver los cambios.
it: Lingua cambiata con successo. Riavvia l'app per vedere le modifiche.
pt: Idioma alterado com sucesso. Reinicie o aplicativo para ver as alterações.

source: File not found.
es: Archivo no encontrado.
it: File non trovato.
pt: Arquivo não encontrado.

# LanguageNotSuported
source: The selected language is not supported. (Av:
es: El idioma seleccionado no es compatible (Disp:
it: La lingua selezionata non è supportata. (Av:
pt: O idioma selecionado não é suportado. (Av:

# HeaderSubtitleMAUI
source: Keep it secret, keep it safe.
es: Mantenlo en secreto, mantenlo a salvo.
it: Tienilo segreto, tienilo al sicuro.
pt: Mantenha em segredo, mantenha seguro.

# MasterKeyTextMAUI
source: Enter your password...
es: Ingresá tu contraseña...
it: Inserisci la tua password...
pt: Digite sua senha...

# LoginBtnText
source: Login
es: Ingresar
it: Accedi
pt: Entrar

# SearchPlaceholder
source: Search...
es: Buscar...
it: Cerca...
pt: Pesquisar...

# EntriesListPageTitleMAUI
source: Entries List
es: Lista de entradas
it: Elenco delle Voci
pt: Lista de entradas

# EditEntrySubtitle
source: Edit entry
es: Editar entrada
it: Modifica voce
pt: Editar entrada

# AddEntrySubtitle
source: Add new entry
es: Añadir nueva entrada
it: Aggiungi voce
pt: Adicionar nova entrada

# SettingsPageTitleMAUI
source: Settings
es: Configuración
it: Impostazioni
pt: Configurações

# AboutPageTitleMAUI
source: About
es: Acerca de
it: Sobre
pt: Sobre

# DevelopedByTextMAUI
source: Developed by
es: Desarrollado por
it: Desenvolvido por
pt: Desenvolvido por

# PasswordPageTitleMAUI
source: Change Password
es: Cambiar contraseña
it: Cambiare la password
pt: Alterar senha

# LanguagePageTitleMAUI
source: Language
es: Idioma
it: Lingua
pt: Idioma

# CloseAppTextMAUI
source: Close
es: Salir
it: Uscire
pt: Sair

# KeyPlaceholderMAUI
source: Enter a key...
es: Ingrese una clave...
it: Inserisci una chiave...
pt: Digite uma chave...

# UserNamePlaceholderMAUI
source: Enter a user name..
es: Ingrese un nombre de usuario...
it: Inserisci un nome utente...
pt: Digite um nome de usuário...

# PasswordPlaceHolderMAUI
source: Enter the password...
es: Ingresa la contraseña...
it: Inserisci la password...
pt: Digite a senha...

# NotesPlaceholderMAUI
source: Add extra notes...
es: Agregue notas adicionales...
it: Aggiungi note extra...
pt: Adicione notas extras...

# SaveButtonTextMAUI
source: Save
es: Guardar
it: Salva
pt: Salvar

# EntryPageTitleMAUI
source: Entry details
es: Detalles de la entrada
it: Dettagli di accesso
pt: Detalhes da entrada

# ImportExportPageTitleMAUI
source: Import/Export
es: Importar/Exportar
it: Importa/Esporta
pt: Importar/Exportar

# DeletePageTitleMAUI
source: Delete
es: Eliminar
it: Elimina
pt: Excluir

# SelectAllTextMAUI
source: Select All
es: Todos
it: Tuttos
pt: Tudos

# DeleteSelectedButtonTextMAUI
source: Delete
es: Eliminar
it: Elimina
pt: Excluir

# ConfirmDeletionHeaderMAUI
source: Confirm Deletion
es: Confirmar eliminación
it: Conferma eliminazione
pt: Confirmar exclusão

# ConfirmDeletionMessageMAUI
source: Are you sure you want to delete the selected entries?
es: ¿Está seguro de que desea eliminar las entradas seleccionadas?
it: Sei sicuro di voler eliminare le voci selezionate?
pt: Tem certeza de que deseja excluir as entradas selecionadas?

# ConfirmDeletionYesButtonMAUI
source: Yes
es: Sí
it: Sì
pt: Sim

# ConfirmDeletionNoButtonMAUI
source: No
pt: Não

# NoEntriesSelectedHeaderMAUI
source: No Entries Selected
es: No hay entradas seleccionadas
it: Nessuna voce selezionata
pt: Nenhuma entrada selecionada

# NoEntriesSelectedMessageMAUI
source: Please select at least one entry to delete.
es: Seleccione al menos una entrada para eliminar.
it: Seleziona almeno una voce da eliminare.
pt: Selecione pelo menos uma entrada para excluir.

# NoEntriesSelectedButtonMAUI
source: OK
es: Aceptar
it: Acettare
pt: Aceitar

# SpinnerTextMAUI
source: Loading...
es: Cargando...
it: Caricamento...
pt: Carregando...

# FilePathNullError
source: File path cannot be null or empty.
es: El path del archivo no puede ser nulo o vacío.
it: Il percorso del file non può essere nullo o vuoto
pt: O caminho do arquivo não pode ser nulo ou vazio.

# AddEntryPageTitleMAUI
source: Add Entry
es: Agregar entrada
it: Aggiungi voce
pt: Adicionar entrada

# EditEntryPageTitleMAUI
source: Edit Entry
es: Editar entrada
it: Modifica voce
pt: Editar entrada

# LanguageChangeTitleMAUI
source: Select Language
es: Seleccionar idioma
it: Seleziona lingua
pt: Selecionar idioma

# ApplyLangButtonTextMAUI
source: Apply Language
es: Aplicar idioma
it: Applica lingua
pt: Aplicar idioma

# PasswordWarningText
source: Important: If you forget your password, you will not be able to recover your information and you will have to reinstall the application.
es: Importante: Si olvidas tu contraseña, no podrás recuperar tu información y deberás reinstalar la aplicación.
it: Importante: Se dimentichi la password, non potrai recuperare le informazioni e dovrai reinstallare l'applicazione.
pt: Importante: Se você esquecer sua senha, não poderá recuperar suas informações e terá que reinstalar o aplicativo.

# PasswordRequiredMAUI
source: Password is required.
es: La contraseña es requerida.
it: La password è richiesta.
pt: Senha é obrigatória.

# PasswordLengthMAUI
source: Password must be at least 3 characters long.
es: La contraseña debe tener al menos 3 caracteres de longitud.
it: La password deve essere lunga almeno 3 caratteri.
pt: A senha deve ter pelo menos 3 caracteres de comprimento.

# PasswordMatchMAUI
source: Passwords do not match.
es: Las contraseñas no coinciden.
it: Le password non corrispondono.
pt: As senhas não coincidem.

# ConfirmPasswordRequiredMAUI
source: Confirm password is required.
es: Se requiere confirmación de contraseña.
it: La conferma della password è richiesta.
pt: Confirmação de senha é obrigatória.

# ConfirmPasswordLengthMAUI
source: Confirm password must be at least 3 characters long.
es: La confirmación de la contraseña debe tener al menos 3 caracteres de longitud.
it: La conferma della password deve essere lunga almeno 3 caratteri.
pt: A confirmação da senha deve ter pelo menos 3 caracteres de comprimento.

# ChangePasswordSubtitleTextMAUI
source: Enter the new password
es: Ingresa la nueva contraseña
it: Inserisci la nuova password
pt: Digite a nova senha

# ChangePasswordPlaceHolderMAUI
source: Enter new password...
es: Ingresa la nueva contraseña...
it: Immettere la nuova password...
pt: Digite a nova senha...

# ConfirmPasswordPlaceHolderMAUI
source: Confirm new password...
es: Confirma la nueva contraseña...
it: Conferma la nuova password...
pt: Confirme a nova senha...

# ChangePasswordButtonTextMAUI
source: Change password
es: Cambiar contraseña
it: Cambia password
pt: Alterar senha

# MasterKeyChangedSuccessMAUI
source: Master key changed successfully.
es: Clave maestra cambiada con éxito.
it: Chiave principale cambiata con successo.
pt: Chave mestra alterada com sucesso.

# MasterKeyChangedErrorMAUI
source: Error changing master key.
es: Error al cambiar la clave maestra.
it: Errore durante la modifica della chiave principale
pt: Erro ao alterar a chave mestra.

# ExportFormatNotSupportedException
source: Export format is not supported.
es: El formato de exportación no es compatible.
it: Il formato di esportazione non è supportato.
pt: O formato de exportação não é suportado.

# PasswordRequiredForEncryptedExportException
source: Password is required for encrypted export.
es: Se requiere contraseña para la exportación cifrada.
it: È richiesta una password per l'esportazione crittografata.
pt: Senha é necessária para exportação criptografada.

# ImportEntriesNullError
source: No entries to import.
es: No hay entradas para importar.
it: Nessuna voce da importare.
pt: Nenhuma entrada para importar.

# LoginPageTitleMAUI
source: Login
es: Iniciar sesión
it: Accedi
pt: Entrar

# DeserializationFailedException
source: Failed to read the file. It may be corrupted or have an invalid format. Please check if the file is password-protected.
es: No se pudo leer el archivo. Puede estar dañado o tener un formato no válido. Verifica si el archivo está protegido con contraseña.
it: Impossibile leggere il file. Potrebbe essere danneggiato o in un formato non valido. Verifica se il file è protetto da password.
pt: Não foi possível ler o arquivo. Ele pode estar corrompido ou em um formato inválido. Verifique se o arquivo está protegido por senha.

# DisplayAlertCancelTitleMAUI
source: Cancelled
es: Cancelado
it: Annullato
pt: Cancelado

# DisplayAlertErrorTitleMAUI
source: Error
it: Errore
pt: Erro

# DisplayAlertInfoTitleMAUI
source: Info
es: Información
it: Informazioni
pt: Informação

# DisplayAlertSuccessTitleMAUI
source: Success
es: Éxito
it: Successo
pt: Sucesso

# EntriesImportedMAUI
source: {0} entries imported!
es: ¡{0} entradas importadas!
it: {0} voci importate!
pt: {0} entradas importadas!

# ExportButtonTextMAUI
source: Export
es: Exportar
it: Esporta
pt: Exportar

# ExportInfoMessageMAUI
source: Please navigate to the folder manually: {0}
es: Por favor, navega manualmente a la carpeta: {0}
it: Per favore, vai manualmente alla cartella: {0}
pt: Por favor, navegue manualmente até a pasta: {0}

# ExportPlaceHolderMAUI
source: Password (if applicable)
es: Contraseña (si aplica)
it: Password (se applicabile)
pt: Senha (se aplicável)

# ExportSubtitleMAUI
source: Export entries
es: Exportar entradas
it: Esporta voci
pt: Exportar entradas

# ExportedFilePathTitleMAUI
source: Exported file
es: Archivo exportado
it: File esportato
pt: Arquivo exportado

# ImportButtonTextMAUI
source: Import
es: Importar
it: Importa
pt: Importar

# ImportPlaceHolderMAUI
source: Password (if applicable)
es: Contraseña (si aplica)
it: Password (se applicabile)
pt: Senha (se aplicável)

# ImportSubtitleMAUI
source: Import entries
es: Importar entradas
it: Importa voci
pt: Importar entradas

# NoEntriesToExportMessageMAUI
source: No entries to export.
es: No hay entradas para exportar.
it: Nessuna voce da esportare.
pt: Nenhuma entrada para exportar.

# NoEntriesToImportMAUI
source: No entries were imported.
es: No se importó ninguna entrada.
it: Nessuna voce è stata importata.
pt: Nenhuma entrada foi importada.

# NoFileSelectedTextMAUI
source: No file selected.
es: Ningún archivo seleccionado.
it: Nessun file selezionato.
pt: Nenhum arquivo selecionado.

# OpenFolderNotSuportedMAUI
source: Opening folders is not supported on this platform.
es: Abrir carpetas no está soportado en esta plataforma.
it: L'apertura di cartelle non è supportata su questa piattaforma.
pt: Abrir pastas não é suportado nesta plataforma.

# UnsupportedFileErrorMAUI
source: Unsupported file type.
es: Tipo de archivo no compatible.
it: Tipo di file non supportato.
pt: Tipo de arquivo não suportado.

# WarningImportTextMAUI
source: Warning: If the file contains entries with the same key, the existing data will be overwritten.
es: Advertencia: Si el archivo contiene entradas con la misma clave, se sobrescribirán los datos existentes.
it: Avviso: Se il file contiene voci con la stessa chiave, i dati esistenti verranno sovrascritti.
pt: Aviso: Se o arquivo contiver entradas com a mesma chave, os dados existentes serão sobrescritos.

# FileStoragePermisionTitleMAUI
source: Permission required
es: Permiso requerido
it: Permesso richiesto
pt: Permissão necessária

# FileStoragePerminsionTextMAUI
source: Storage access is required to import files.
es: Se necesita acceso al almacenamiento para importar archivos.
it: L'accesso all'archiviazione è necessario per importare file.
pt: O acesso ao armazenamento é necessário para importar arquivos.

# AboutVersionTextMAUI
source: Version: 1.0.0
es: Versión: 1.0.0
it: Versione: 1.0.0
pt: Versão: 1.0.0

# AboutDeveloperTextMAUI
source: Developer: Sebastián Ualde Ramírez
es: Desarrollador: Sebastián Ualde Ramírez
it: Sviluppatore: Sebastián Ualde Ramírez
pt: Desenvolvedor: Sebastián Ualde Ramírez

# AboutPlatformsTextMAUI
source: Platforms: Android / Windows
es: Plataformas: Android / Windows
it: Piattaforme: Android / Windows
pt: Plataformas: Android / Windows

# AboutLicenseTextMAUI
source: License: Free, offline, and tracker-free.
es: Licencia: Libre, sin conexión y sin rastreadores.
it: Licenza: Gratuita, offline e senza tracciatori.
pt: Licença: Livre, offline e sem rastreadores.

# AboutWhatIsItTitleMAUI
source: 🔐 What is RingBearer?
es: 🔐 ¿Qué es RingBearer?
it: 🔐 Cos'è RingBearer?
pt: 🔐 O que é o RingBearer?

# AboutWhatIsItTextMAUI
source: RingBearer is a simple, offline password manager designed for those who value privacy and total control over their data.
es: RingBearer es un gestor de contraseñas local, simple y sin conexión, diseñado para quienes valoran la privacidad y el control absoluto sobre sus datos.
it: RingBearer è un gestore di password locale, semplice e offline, pensato per chi dà valore alla privacy e al pieno controllo dei propri dati.
pt: RingBearer é um gerenciador de senhas simples e offline, feito para quem valoriza privacidade e controle total dos seus dados.

# AboutFeaturesTitleMAUI
source: 🧰 Features
es: 🧰 Funcionalidades
it: 🧰 Funzionalità
pt: 🧰 Funcionalidades

# AboutFunctionality1TextMAUI
source: • Create, edit, and delete entries.
es: • Crear, editar y eliminar entradas.
it: • Crea, modifica ed elimina voci.
pt: • Criar, editar e excluir entradas.

# AboutFunctionality2TextMAUI
source: • Local search and filtering.
es: • Buscar y filtrar localmente.
it: • Ricerca e filtro locali.
pt: • Busca e filtro local.

# AboutFunctionality3TextMAUI
source: • Strong encryption (AES-256).
es: • Cifrado fuerte (AES-256).
it: • Crittografia forte (AES-256).
pt: • Criptografia forte (AES-256).

# AboutFunctionality4TextMAUI
source: • Local synchronization between files.
es: • Sincronización local entre archivos.
it: • Sincronizzazione locale tra file.
pt: • Sincronização local entre arquivos.

# AboutFunctionality5TextMAUI
source: • MD5 - SHA-256 checks (file integrity).
es: • Verificación por MD5 - SHA-256 (integridad de archivos).
it: • Verifica MD5 - SHA-256 (integrità dei file).
pt: • Verificação MD5 - SHA-256 (integridade dos arquivos).

# AboutImportantTitleMAUI
source: ⚠️ Important
es: ⚠️ Importante
it: ⚠️ Importante
pt: ⚠️ Importante
