Repository: sebaualde/RingBearer
Catalog: RingBearer.Core/Resources/Messages.*.resx
Languages: es, it, pt

# AboutImportant1TextMAUI
source: RingBearer does not connect to the internet.
es: RingBearer no se conecta a internet.
it: RingBearer non si connette a internet.
pt: RingBearer não se conecta à internet.

# AboutImportant2TextMAUI
source: If you lose your file or master key, it cannot be recovered.
es: Si perdés tu archivo o tu clave maestra, no se puede recuperar.
it: Se perdi il file o la chiave principale, non potrà essere recuperato.
pt: Se você perder o arquivo ou a senha mestra, não será possível recuperar.

# AboutImportant3TextMAUI
source: Keep a secure backup and remember your password.
es: Conservá una copia segura y recordá tu contraseña.
it: Tieni una copia sicura e ricorda la tua password.
pt: Guarde uma cópia segura e memorize sua senha.

# AboutAuthorTitleMAUI
source: 🧙 Author
es: 🧙 Autor
it: 🧙 Autore
pt: 🧙 Autor

# AboutAuthorTextMAUI
source: App made by a dev who prefers keeping secrets offline—and a good coffee over a daily scrum. ☕😉
es: App creada por un dev que prefiere guardar secretos offline y que prefiere un buen café antes que una daily de scrum. ☕😉
it: App creata da uno sviluppatore che preferisce tenere i segreti offline — e un buon caffè al posto di uno scrum giornaliero. ☕😉
pt: App criado por um dev que prefere guardar segredos offline — e um bom café no lugar de um daily scrum. ☕😉

# AboutLearnMoreTextMAUI
source: Learn More
es: Saber más
it: Scopri di più
pt: Saiba mais

# AboutPrivacyPolicyTextMAUI
source: Privacy Policy
es: Política de Privacidad
it: Politica sulla Privacy
pt: Política de Privacidade

# AboutTermsServiceTextMAUI
source: Terms of Service
es: Términos del Servicio
it: Termini di Servizio
pt: Termos de Serviço

# AboutCheckForUpdatesTextMAUI
source: Check for Updates
es: Buscar actualizaciones
it: Verifica aggiornamenti
pt: Verificar atualizações

# DisplayAlertOkButtonTextMAUI
source: OK
es: Aceptar
